app/controllers/recipes_controller.rb

  def show
    recipe = Recipe.find_by(id: params[:id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]