app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("photo", "title", "description", "ingredients", "instructions", "category", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    recipe = Recipe.create(photo: params[:photo], title: params[:title], description: params[:description], ingredients: params[:ingredients], instructions: params[:instructions], category: params[:category], user_id: session[:user_id])

SELECT "recipes"."title" FROM "recipes" ORDER BY "recipes"."title" ASC
---
  def sort
    recipes = Recipe.all.order(:title).pluck(:title)