app/controllers/reviews_controller.rb

  def show
    user = User.find_by(id: session[:user_id])
    reviews = user.reviews.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = $1  [["user_id", 1]]