app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("user_id", "recipe_id", "review_text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["recipe_id", 2], ["review_text", "This baked good was so so..."], ["created_at", "2022-09-20 15:02:41.384348"], ["updated_at", "2022-09-20 15:02:41.384348"]]
---
  def create
    review = Review.create(user_id: session[:user_id], recipe_id: params[:recipe_id], review_text: params[:review_text])

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "reviews" SET "review_text" = $1, "updated_at" = $2 WHERE "reviews"."id" = $3  [["review_text", "This recipe was bad, so so bad"], ["updated_at", "2022-10-04 13:43:27.935839"], ["id", 1]]
---
  def update
    review = Review.find_by(id: params[:id])
    user = User.find_by(id: session[:user_id])
    if review.user_id == user.id
      review.update(review_params)

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 8]]
---
  def destroy
    review = Review.find_by(id: params[:id])
    user = User.find_by(id: session[:user_id])
    if review.user_id == user.id
      review.destroy